<style>
div{width:100px; float:left}
</style>
<?php
/*
 +----------------------------------------------------------------------
 + Title        : 正9 X 9乘法表
 + Author       : 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-05-22 11:19:00
 + Last-time    : 2017-05-22 11:19:00 + 小黄牛
 + Desc         : 用FOR输出正9 X 9乘法表
    合理运用IO进行逻辑操作
 +----------------------------------------------------------------------
*/

/**
 * 顺向思维，FOR输出正9 X 9乘法表
 * @return : 无
*/
function Demo(){

    # 外FOR控制行
    for ($i=1; $i<=9; $i++) {

        # 内FOR控制列
        for ($k=1; $k<=$i; $k++) {
            echo "<div>{$i} X {$k} = " .$i*$k. '</div>';
        }

        echo '<br/>';
    }
}

Demo(5);

